blog/2016-08-11-hadoop.org
#+TITLE: TODO Hadoop
#+DATE: 2016-08-11
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: 服务器
#+JEKYLL_TAGS: Linux 高性能计算
#+JEKYLL_PUBLISHED: true

#+BEGIN_EXAMPLE
2003年：The Google File System
2004年：MapReduce: Simplified Data Processing On Large Cluster
2006年：BigTable: A Distributed Storage System for Structure Data

HDFS + MapReduce = Hadoop
HBase: Hadoop Database，是一个列式存储数据库，运行在HDFS之上
#+END_EXAMPLE
* 大数据
- 结构化数据：约束
- 半结构化数据：有结构但没有约束
- 非结构化数据：没有元数据
* MapReduce
- map和reduce的处理操作类似于Python的map和reduce函数，具体的过程由程序员所定义
  - mapper: 处理或拆分数据，生成结果列表(k-v数据)
  - combiner(可选): 初步对mapper生成的结果进行合并处理
  - partitioner: 负责将mapper生成的结果根据键发送给对应的reducer，同一个键发往同一个reducer
  - reducer: 对mapper生成的结果列表进行合并处理，生成最终结果
- 可能需要多次MapReduce才能得到最终结果
* Hadoop
- HDFS为MapReduce提供了运行框架
  - NN(NameNode): 负责存储文件的元数据
  - SNN(SecondaryNameNode): 辅助NN定期合并元数据的修改日志到磁盘的fsimage中
  - DN(DataNode): 存储文件的内容，通过副本进行高可用，同时作为MapReduce的TaskTracker
- Hadoop v1中，MapReduce提供了运行Hadoop程序的环境
  - JobTracker: 根据提交的程序，负责调度分配每一个子任务task运行于TaskTracker上，并管理TaskTracker资源
  - TaskTracker: 运行JobTracker所分配的任务，可能需要从其他DN获取数据
- Hadoop v2中，YARN成为了运行Hadoop的环境
  - ResourceManager代替集群管理器
  - ApplicationMaster代替一个专用且短暂的JobTracker，即负责调度分配每一个子任务task运行于
  - NodeManager代替TaskTracker，周期性报告节点信息
  - 一个分布式应用程序代替一个MapReduce作业
* Hadoop
** 运行模式
- 单机模型：测试使用
- 伪分布式模型：运行于单机
- 分布式模型：集群模型
